```diff
# aws_ecr_lifecycle_policy.rule[4] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "rule" {
      ~ id          = "trade-tariff-search-query-parser" -> (known after apply)
      ~ registry_id = "777015734912" -> (known after apply)
      ~ repository  = "trade-tariff-search-query-parser" -> "tariff-search-query-parser" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.docker[4] must be replaced
-/+ resource "aws_ecr_repository" "docker" {
      ~ arn                  = "arn:aws:ecr:eu-west-2:777015734912:repository/trade-tariff-search-query-parser" -> (known after apply)
      ~ id                   = "trade-tariff-search-query-parser" -> (known after apply)
      ~ name                 = "trade-tariff-search-query-parser" -> "tariff-search-query-parser" # forces replacement
      ~ registry_id          = "777015734912" -> (known after apply)
      ~ repository_url       = "777015734912.dkr.ecr.eu-west-2.amazonaws.com/trade-tariff-search-query-parser" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.```